jaiarobotics/jaiabot/src/stm32/power_board/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "fatfs.h"
#include "stm32l4xx_hal_def.h"
#include "stm32l4xx_hal_gpio.h"
#include "stm32l4xx_hal_uart.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"
#include <string.h>
#include "bluetoothLE.h"
#include "rtc3231m.h"
#include "eepromM24128.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

IWDG_HandleTypeDef hiwdg;

LPTIM_HandleTypeDef hlptim1;

UART_HandleTypeDef hlpuart1;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim15;
TIM_HandleTypeDef htim16;

/* USER CODE BEGIN PV */
static volatile uint8_t lptim_wake_flag = 0;
/* LSI ~32 kHz, LPTIM prescaler /128 -> 250 Hz. 10 s = 2500 counts. */
#define LPTIM_10SEC_PERIOD  (2500U - 1U)

enum state currentState = INIT_STATE;
enum state nextState = INIT_STATE;

enum testState currentTestState = BLE_TEST;
enum testState nextTestState = BLE_TEST;

// Override _write() for printf redirection
int _write(int file, char *ptr, int len) {
    CDC_Transmit_FS((uint8_t*) ptr, len); return len;
}

uint8_t bits_in_byte = 8;
bool usb_tx_busy = false;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_IWDG_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM15_Init(void);
static void MX_TIM16_Init(void);
static void MX_LPTIM1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static uint32_t adc_read_channel(ADC_HandleTypeDef *hadc, uint32_t channel)
{
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_92CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;
    HAL_ADC_ConfigChannel(hadc, &sConfig);
    HAL_ADC_Start(hadc);
    HAL_ADC_PollForConversion(hadc, HAL_MAX_DELAY);
    uint32_t raw = HAL_ADC_GetValue(hadc);
    HAL_ADC_Stop(hadc);
    return raw;
}

#define ADC_TO_VOLTS(raw) ((raw) / 4095.0f * 3.3f)

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* Infinite state loop */
  while (1){
    switch (currentState){
      case INIT_STATE:
        systemInit();

        #ifdef COMP_TEST
          nextState = COMP_TEST_STATE;
        #else
        #ifdef SOFT_TEST
          nextState = SOFT_TEST_STATE;
        #else
          nextState = MAIN_STATE;
        #endif
        #endif

        break;

      case COMP_TEST_STATE:
        switch (currentTestState){
          case USB_TEST:
            #ifdef COMP_USB_TEST
            if (HAL_GPIO_ReadPin(USB_SENSE_GPIO_Port, USB_SENSE_Pin) == GPIO_PIN_SET){
              printf("USB: CONNECTED\n");
            }
            else{
              printf("USB: DISCONNECTED\n");
            }
            #endif
            nextTestState = BLE_TEST;
            break;

          case BLE_TEST:
            #ifdef COMP_BLE_TEST
            switch (BLE_test()){
              case 0:
                printf("BLE: PASS\n");
                break;
              case 1:
                printf("BLE: ERROR_BLE NO_START\n");
                break;
              case 2:
                printf("BLE: ERROR_BLE NO_STATUS\n");
                break;
            }
            #endif
            nextTestState = RTC_TEST;
            break;
          
          case RTC_TEST:
            #ifdef COMP_RTC_TEST
            switch (rtc_test()){
              case 0:
                printf("RTC: PASS\n");
                break;
              case 1:
                printf("RTC: ERROR_RTC TIME_MATCH_ERROR\n");
                break;
              case 2:
                printf("RTC: ERROR_RTC SET_TIME_ERROR\n");
                break;
              case 3:
                printf("RTC: ERROR_RTC READ_TIME_ERROR\n");
                break;
            }
            #endif
            nextTestState = EEPROM_TEST;
            break;
          
          case EEPROM_TEST:
            #ifdef COMP_EEPROM_TEST
            switch(eprmTest()){
              case 0:
                printf("EPRM: PASS\n");
                break;
              case 1:
                printf("EPRM: ERROR_EEPROM WRITE_ERROR\n");
                break;
              case 2:
                printf("EPRM: ERROR_EEPROM READ_ERROR\n");
                break;
              case 3:
                printf("EPRM: ERROR_EEPROM DATA_MATCH_ERROR\n");
                break;
            }
            #endif

            #ifdef LOOP_COMP_TEST
              nextTestState = USB_TEST;
            #else
            #ifdef IDLE_COMP_TEST
              nextState = IDLE_STATE;
            #else
            #ifdef SOFT_TEST
              nextState = SOFT_TEST_STATE;
            #else
            #ifndef MAIN_DISABLE
              nextState = MAIN_STATE;
            #endif
            #endif
            #endif
            #endif
            break;
        }
        currentTestState = nextTestState;
        break;
      
