jaiarobotics/jaiabot/src/stm32/power_board/Core/Src/main.c
// Jumps to the STM32 ROM bootloader (system memory), which on this part
// (STM32L433) re-enumerates the USB peripheral as a DFU device so the
// application can be reflashed with dfu-util over the same USB cable.
// Erases the application's first flash page (its vector table) first, so
// this is a one-way trip: if the reflash is aborted, the board will sit in
// the bootloader rather than boot back into the old application.
void jumpToBootloader(void)
{
  HAL_FLASH_Unlock();

  FLASH_EraseInitTypeDef eraseInitStruct = {0};
  uint32_t pageError = 0;

  eraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
  eraseInitStruct.Banks = FLASH_BANK_1;
  eraseInitStruct.Page = 0;
  eraseInitStruct.NbPages = 1;

  if (HAL_FLASHEx_Erase(&eraseInitStruct, &pageError) != HAL_OK)
  {
    HAL_FLASH_GetError();
    while (1)
      ;
  }

  uint32_t address = 0x08000000;
  uint64_t data_to_write = 0xFFFFFFFFFFFFFFFF;

  if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, data_to_write) != HAL_OK)
  {
    HAL_FLASH_GetError();
    while (1)
      ;
  }

  HAL_FLASH_Lock();

  __disable_irq();

  SysTick->CTRL = 0;

  HAL_RCC_DeInit();

  for (uint8_t i = 0; i < (sizeof(NVIC->ICER) / sizeof(NVIC->ICER[0])); i++)
  {
    NVIC->ICER[i] = 0xFFFFFFFF;
    NVIC->ICPR[i] = 0xFFFFFFFF;
  }

  __enable_irq();

  __set_MSP(BOOTVTAB->Initial_SP);

  BOOTVTAB->Reset_Handler();
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
